Tekla Open API Reference for Tekla Structures 2025
LineSegment Methods
The LineSegment type exposes the following members.
Methods
Name | Description
Clone
 Creates a copy of itself
Equals(Object)
 Returns true if the objects are equal.
 (Overrides Object.Equals(Object).)
Equals(ICurve)
 Returns true if the other curve is a line segment equal to this
GetDirectionVector
 Returns a new unit direction vector of a line segment.
GetHashCode
 Returns a hash code for a line segment. Notice, in extremely rare cases, you might not get the same hash code for two line segments even though they are considered equal! This should, however, happen only in extremely rare cases!
 (Overrides Object.GetHashCode().)
Length
 Returns the length of a line segment.
Top
See Also
Reference
LineSegment Class
Tekla.Structures.Geometry3d Namespace